# Массивы с символами для русской и английской раскладок

ru = ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ',
      'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э',
      'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.',
      'ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=',
      'Ё', '!', '"', '№', ';', '%', ':', '?', '*', '(', ')', '_', '+',
      'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ',
      'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э',
      'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', ',', ' ']

en = ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']',
      'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'",
      'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/',
      '`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=',
      '~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+',
      'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}',
      'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"',
      'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', ' ']


def translate(text, source_text, target_text):
    translated_text = []
    for char in text:
        if char in source_text:
            index = source_text.index(char)
            translated_text.append(target_text[index])
        else:
            translated_text.append(char)
    return ''.join(translated_text)


if __name__ == "__main__":
    print("Добро пожаловать в программу исправления раскладки.")
    print("Выберите опцию:")
    print("1 - Исправить текст, написанный на русской раскладке")
    print("2 - Исправить текст, написанный на английской раскладке")

    choice = input("Введите номер опции (1 или 2): ")

    if choice == "1":
        input_text = input("Введите текст на русской раскладке: ")
        print("Исправленный текст:", translate(input_text, ru, en))
    elif choice == "2":
        input_text = input("Введите текст на английской раскладке: ")
        print("Исправленный текст:", translate(input_text, en, ru))
    else:
        print("Ошибка. Неизвестный выбор опции.")
